{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features for a Performance Gallery component including scroll animations, hover effects, modal lightbox, and responsive styling with green/black/white theme.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing a portfolio website with Hero, About, Skills, Results, Case Studies, Services, Testimonials, Contact, and Footer sections using a green/black/white color theme.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with grayscale and chart color variables.",
  "frontend/index.html": "HTML entry point for a React application titled 'Kartik Tyagi - Performance Marketing Specialist' with preload link for resume.pdf.",
  "frontend/src/App.tsx": "Main React application component rendering a full-page portfolio layout with Hero, About, CoreSkills, ExtendedCapabilities, Results, CaseStudies, Services, Testimonials, Contact, and Footer sections.",
  "frontend/src/components/About.tsx": "Experience & Impact section with scroll animation, black stripe header, intro paragraph about performance marketing, and three experience cards for VRH Derma, Award-Wala, and PrashantAdvait Foundation with green bullet points.",
  "frontend/src/components/CaseStudies.tsx": "Case Studies section displaying two detailed case study cards (VRH Derma with 640% ROI and Award-Wala B2B campaign) including problem, strategy, results, key metrics, and PerformanceGallery component with Meta Ads screenshots.",
  "frontend/src/components/Contact.tsx": "Contact form section with name, email, and message inputs, green submit button, social media links (LinkedIn, Instagram), and scroll animation effects.",
  "frontend/src/components/CoreSkills.tsx": "Displays a grid of 8 core marketing skills (Meta Ads, Google Ads, CRO, etc.) with scroll animation and hover effects.",
  "frontend/src/components/ExtendedCapabilities.tsx": "Shows a grid of 4 extended capabilities (Creative Strategy, Video Editing, Pixel Setup, Analytics) with similar styling to CoreSkills.",
  "frontend/src/components/Footer.tsx": "Footer component with social links (LinkedIn, Instagram), copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section with profile photo, animated headline introducing Kartik Tyagi as a Digital Marketer, and CTA buttons for viewing work and resume.",
  "frontend/src/components/ImageLightbox.tsx": "Modal lightbox component for viewing images with keyboard navigation (arrows, escape), prev/next buttons, and image counter display.",
  "frontend/src/components/PerformanceGallery.tsx": "Grid gallery component that displays performance images with click-to-enlarge functionality using the ImageLightbox modal.",
  "frontend/src/components/Results.tsx": "Results section displaying 4 animated metrics (Ad Spend, Lead Growth, ROI, Sales Growth) alongside a profile picture with counter animations.",
  "frontend/src/components/Services.tsx": "Services section showing 6 service offerings (Paid Media, Campaign Strategy, Funnel Optimization, etc.) in a responsive grid layout.",
  "frontend/src/components/Testimonials.tsx": "Carousel component displaying client testimonials with navigation buttons and dot indicators. Uses scroll animation hook and manages current testimonial index with prev/next controls.",
  "frontend/src/components/WhyWorkWithMe.tsx": "Section component displaying five key reasons to work with the consultant in a responsive grid layout. Features scroll animation and hover effects on reason cards.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing Internet Computer actor creation with authentication support. Handles both authenticated and anonymous actors, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Hook providing animated number counting with easing effects. Supports number, currency, and decimal formats with configurable duration and visibility trigger.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication on ICP. Manages login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for backend queries. Intentionally minimal as all content is static and managed in frontend components.",
  "frontend/src/hooks/useScrollAnimation.tsx": "Hook using IntersectionObserver to trigger visibility state when element enters viewport. Returns ref and isVisible boolean for scroll-triggered animations.",
  "frontend/src/index.css": "Global styles defining color system with professional green and strong black accents, custom utilities for shadows and animations, and accessibility considerations for reduced motion.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers. Renders root App component with necessary context wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom colors using OKLCH color space, typography settings, shadows, and animation keyframes for accordion and fade effects.",
  "project_state.json": "Project state tracking file documenting a portfolio website with Performance Gallery feature in case studies, including Meta Ads performance screenshots with animations, modal lightbox, and scroll effects. Contains architectural notes, feature tracking with requirement IDs, and image specifications for Meta Ads dashboard screenshots showing campaign metrics."
}