{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: a green/black/white color theme redesign across all components, and a professional headshot replacement in the hero section.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component structure, styling, and functionality after the green/black/white theme implementation.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, implementing the green/black/white theme with custom properties for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta, favicon, title for Kartik Tyagi's portfolio, and preload link for resume.pdf.",
  "frontend/src/App.tsx": "Main app component rendering the full portfolio page with 10 sections in sequence: Hero, About, CoreSkills, ExtendedCapabilities, Results, CaseStudies, Services, Testimonials, Contact, and Footer.",
  "frontend/src/components/About.tsx": "Experience & Impact section with black stripe header, intro paragraph about performance marketing achievements, and three white cards showcasing work at VRH Derma, Award-Wala, and PrashantAdvait Foundation with green bullet points.",
  "frontend/src/components/CaseStudies.tsx": "Two detailed case study cards (VRH Derma D2C skincare with 640% ROI and Award-Wala B2B lead gen) featuring problem-strategy-results structure, key metrics, before/after comparisons, and black stripe header with green accents.",
  "frontend/src/components/Contact.tsx": "Contact form section with black stripe header, white card containing name/email/message inputs with green focus states, green submit button, and social media links (LinkedIn/Instagram) with green hover effects.",
  "frontend/src/components/CoreSkills.tsx": "Displays a grid of 8 core marketing skills (Meta Ads, Google Ads, CRO, etc.) with scroll animation and hover effects.",
  "frontend/src/components/ExtendedCapabilities.tsx": "Shows 4 extended capabilities (Creative Strategy, Video Editing, Tracking Setup, Analytics) in a grid layout with scroll animations.",
  "frontend/src/components/Footer.tsx": "Footer component with social links (LinkedIn, Instagram), copyright notice, and attribution to caffeine.ai with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section with circular profile photo, animated headline introducing Kartik Tyagi as a digital marketer, and CTA buttons for viewing work and downloading resume.",
  "frontend/src/components/Results.tsx": "Displays 4 animated metrics (ad spend managed, lead growth, ROI, sales growth) using counter animations triggered on scroll visibility.",
  "frontend/src/components/Services.tsx": "Grid of 6 service cards (Paid Media Management, Campaign Strategy, Funnel Optimization, etc.) with descriptions and hover effects.",
  "frontend/src/components/Testimonials.tsx": "Carousel component displaying client testimonials with navigation buttons and dot indicators for cycling through 3 testimonials.",
  "frontend/src/components/WhyWorkWithMe.tsx": "Grid layout showcasing 5 reasons to work with Kartik (Data-Driven Approach, Clear Communication, ROI-Focused, etc.) with scroll animations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous actor based on Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCounterAnimation.ts": "Custom React hook that animates a number from 0 to a target value using easeOutQuart easing, supporting number, currency, and decimal formats with locale-specific formatting.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data operations are needed; all content is static and managed in frontend components.",
  "frontend/src/hooks/useScrollAnimation.tsx": "Custom React hook using IntersectionObserver to detect when an element enters the viewport and trigger visibility state for scroll-based animations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a green/black/white professional theme, including color variables, utility classes, animations (fadeIn, slideUp, float), and accessibility considerations for reduced motion.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (professional-green, strong-black, dark-grey), typography, shadows, border radius, and keyframe animations for the portfolio design system.",
  "project_state.json": "Project state document defining the portfolio website architecture with green/black/white theme, resume optimization strategy, section ordering, case studies for VRH Derma and Award-Wala, and image requirements."
}